#فانکشن 
#برای شاخت فانکشن از کلمه کلیدی def استفاده میکنیم بعد برای فانکشن یه سام و جلوی اسم پرانتز میزاریم

#مثال

def sajjad():
    print("sajadghadimi")
#sajjad == اسم فانکشنتون
sajjad()

#خروجی: sajadghadimi
#توی فانکشن ها هر کاری دلت بخواد میتونی بکنی از حلقه ها گزفته تا شرط ها

#ما به فانکشن ها ورودی هم میتونیم بدیم مثال

def show(name): #همیشه سعی کن ورودی معنی دار باشه مثلا ننویس xیا a
    print("hello " + name)

show("sajjad")

#خروجی : hello sajjad
 
#show == اسم فانکشنتون


#و حتی پیشرتف تر هم میشه  کرد 
#مثال

def aa(name , age):
    print("heloo" , name)
    print("age: " + age)

aa("sajjad" , "15")
#خروجی:#
#heloo sajjad
#age: 15


#نکته : هیچ وقت عدد رو بصورن int نفرس داخل دابل کوتیشن ("") بزار 
#مثال : "15"


#روش دیگه اینه 

def gg(naame = "sajjad"):
    print("hello" + naame + "khobi?")

gg()
#خروجی : hello sajjad khobi?


#خب توی این کد اگه من داخل فانکشن چیزی نوشتم اون چاپ یعنی اولویت اول با اونه و اگر چیزی ننوشتم فانکشن بالا یا همون
#sajjad برام چاپ میشه 

#ولی اگه داخل فانکشن پایین چیزی نوشتم اون چاپ میشه 

#مثال 

def jj(nname = "sajjad"):
    print ("hi " + nname)

jj("mohamad")#چون الویت اول با اینه این چاپ میشه نه پایینی 
#خروجی : hi mohamad

#اینم از این
